app/controllers/categories_controller.rb

  def index
    @categories = Category.find(:all)
---
SELECT * FROM "categories" WHERE ("categories"."id" = 2)

  def edit
    @categories = Category.find(:all)
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "updated_at", "parent_id", "created_at") VALUES(E'Leasure', '2009-01-16 15:01:21.012305', NULL, '2009-01-16 15:01:21.012305') RETURNING "id"

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "parent_id" = 2, "updated_at" = '2009-01-22 10:31:18.570939' WHERE "id" = 1

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT * FROM "categories" WHERE ("categories".parent_id = 2) ORDER BY name
DELETE FROM "categories" WHERE "id" = 1