app/controllers/folders_controller.rb

SELECT * FROM "folders" WHERE ("folders"."id" = 1)
---
  def show
    @folder = Folder.find(params[:id])

INSERT INTO "folders" ("name", "updated_at", "category_id", "parent_id", "created_at") VALUES(E'Root', '2009-01-16 13:31:31.996280', NULL, NULL, '2009-01-16 13:31:31.996280') RETURNING "id"
---
  def create
    @folder = Folder.new(params[:folder])

    respond_to do |format|
      if @folder.save