app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts".folder_id = 1) ORDER BY created_at
---
  def index
    if @folder
      @posts = @folder.posts.find(:all, :order=>:created_at)

SELECT * FROM "folders" WHERE ("folders"."id" = 1)
SELECT * FROM "categories"
---
  def new
    @folders= Folder.find :all
    @categories=Category.find :all

SELECT * FROM "folders"
SELECT * FROM "categories"
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def edit
    @folders= Folder.find :all
    @categories=Category.find :all

    @post = Post.find(params[:id])

INSERT INTO "posts" ("image_file_size", "updated_at", "review", "body", "image_content_type", "folder_id", "subject", "category_id", "views", "author_id", "status_id", "comments_count", "image", "image_updated_at", "created_at", "image_file_name") VALUES(17900, '2009-01-22 09:02:00.933542', E'', E'asdf', E'image/jpeg', 1, E'', 1, 0, 1, 1, 0, NULL, '2009-01-22 11:02:00.750869', '2009-01-22 09:02:00.933542', E'am-logo.jpg') RETURNING "id"
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "views" = 0, "image_content_type" = E'image/jpeg', "image_file_name" = E'am-logo.jpg', "image_file_size" = 17900, "image_updated_at" = '2009-01-22 10:58:46.792810', "updated_at" = '2009-01-22 08:58:47.415124' WHERE "id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def destroy
    @post = Post.find(params[:id])